Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_tfat_drv_if.c
* Description  : TFAT driver Interface.
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 01.12.2014 1.00    First Release
*              : 21.01.2015 1.01    Added Support USB Mini Firmware.
*              : 22.06.2015 1.02    Added support MCU RX231.
*              : 01.04.2016 1.03    Updated the xml file.
*              : 29.06.2018 1.04    Modified get_fattime() and
*                                   SD memory device.
*              : 14.12.2018 1.05    Supporting USB dirver for RTOS.
*              : 08.08.2019 2.00    Added support for FreeRTOS and Renesas uITRON (RI600V4).
*                                   Added support for GNUC and ICCRX.
*              : 10.06.2020 2.10    Added Support MMC Firmware and FLASH Firmware.
*              : 31.08.2023 2.30    Updated FatFs ff15.
*              : 15.12.2023 2.40    Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*              : 08.05.2024 2.50    Added support SPI mode SD card.
*              : 30.09.2024 2.60    Changed the comment of API functions to the Doxygen style.
*                                   Fixed to comply with GSCE Coding Standards Rev.6.5.0.
*              : 15.03.2025 2.61    Updated disclaimer.
***********************************************************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
*******************************************************************************/
#include "platform.h"
#include "r_tfat_driver_rx_if.h"
#include "r_tfat_driver_rx_config.h"
#include "r_tfat_drv_if_dev.h"

#include "r_sys_time_rx_if.h"

/*******************************************************************************
Macro definitions
*******************************************************************************/
/* for USB */
#if (TFAT_USB_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_USB)
#define USB_NUM_0    (1)
#define DRV0_DEV_CH  (0)
#else
#define USB_NUM_0    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_USB)
#define USB_NUM_1    (1<<1)
#define DRV1_DEV_CH  (0 + USB_NUM_0)
#else
#define USB_NUM_1    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_USB)
#define USB_NUM_2    (1<<2)
#define DRV2_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1))
#else
#define USB_NUM_2    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_USB)
#define USB_NUM_3    (1<<3)
#define DRV3_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2))
#else
#define USB_NUM_3    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_USB)
#define USB_NUM_4    (1<<4)
#define DRV4_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) \
                        + (USB_NUM_3>>3))
#else
#define USB_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_USB)
#define USB_NUM_5    (1<<5)
#define DRV5_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) \
                        + (USB_NUM_3>>3) + (USB_NUM_4>>4))
#else
#define USB_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_USB)
#define USB_NUM_6    (1<<6)
#define DRV6_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) \
                        + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5))
#else
#define USB_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_USB)
#define USB_NUM_7    (1<<7)
#define DRV7_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) \
                        + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5) \
                        + (USB_NUM_6>>6))
#else
#define USB_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_USB)
#define USB_NUM_8    (1<<8)
#define DRV8_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) \
                        + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5) \
                        + (USB_NUM_6>>6) + (USB_NUM_7>>7))
#else
#define USB_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_USB)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_USB)
#define USB_NUM_9    (1<<9)
#define DRV9_DEV_CH  (0 + USB_NUM_0 + (USB_NUM_1>>1) + (USB_NUM_2>>2) \
                        + (USB_NUM_3>>3) + (USB_NUM_4>>4) + (USB_NUM_5>>5) \
                        + (USB_NUM_6>>6) + (USB_NUM_7>>7) + (USB_NUM_8>>8))
#else
#define USB_NUM_9    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_USB)

static uint32_t TFAT_DRIVE_USB_ALLOC = (USB_NUM_9 | USB_NUM_8 | USB_NUM_7 | \
                                        USB_NUM_6 | USB_NUM_5 | USB_NUM_4 | \
                                        USB_NUM_3 | USB_NUM_2 | USB_NUM_1 | \
                                        USB_NUM_0);

#if TFAT_USB_DRIVE_NUM != ((USB_NUM_9>>9)+(USB_NUM_8>>8)+(USB_NUM_7>>7)+ \
                            (USB_NUM_6>>6)+(USB_NUM_5>>5)+ (USB_NUM_4>>4)+ \
                            (USB_NUM_3>>3)+(USB_NUM_2>>2)+(USB_NUM_1>>1)+ \
                            USB_NUM_0)
#error "Error! Invalid setting for TFAT_USB_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif /* (TFAT_USB_DRIVE_NUM > 0) */


/* for SD memory card */
#if (TFAT_SDMEM_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_0   (1)
#define DRV0_DEV_CH   (0)
#else
#define SDMEM_NUM_0   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_1   (1<<1)
#define DRV1_DEV_CH   (0 + SDMEM_NUM_0)
#else
#define SDMEM_NUM_1   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_2   (1<<2)
#define DRV2_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1))
#else
#define SDMEM_NUM_2   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_3   (1<<3)
#define DRV3_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2))
#else
#define SDMEM_NUM_3   (0)
#endif //  (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_4   (1<<4)
#define DRV4_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) \
                        + (SDMEM_NUM_3>>3))
#else
#define SDMEM_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_5   (1<<5)
#define DRV5_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) \
                        + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4))
#else
#define SDMEM_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_6   (1<<6)
#define DRV6_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) \
                    + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5))
#else
#define SDMEM_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_7   (1<<7)
#define DRV7_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) \
                    + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5) \
                    + (SDMEM_NUM_6>>6))
#else
#define SDMEM_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_8   (1<<8)
#define DRV8_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) \
                    + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5) \
                    + (SDMEM_NUM_6>>6) + (SDMEM_NUM_7>>7))
#else
#define SDMEM_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SDMEM)
#define SDMEM_NUM_9   (1<<9)
#define DRV9_DEV_CH   (0 + SDMEM_NUM_0 + (SDMEM_NUM_1>>1) + (SDMEM_NUM_2>>2) \
                    + (SDMEM_NUM_3>>3) + (SDMEM_NUM_4>>4) + (SDMEM_NUM_5>>5) \
                    + (SDMEM_NUM_6>>6) + (SDMEM_NUM_7>>7) + (SDMEM_NUM_8>>8))
#else
#define SDMEM_NUM_9   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SDMEM)

static uint32_t TFAT_DRIVE_SDMEM_ALLOC = (SDMEM_NUM_9 | SDMEM_NUM_8 | \
                                    SDMEM_NUM_7 | SDMEM_NUM_6 | SDMEM_NUM_5 | \
                                    SDMEM_NUM_4 | SDMEM_NUM_3 | SDMEM_NUM_2 | \
                                    SDMEM_NUM_1 | SDMEM_NUM_0);

#if TFAT_SDMEM_DRIVE_NUM != ( (SDMEM_NUM_9>>9)+(SDMEM_NUM_8>>8)+ \
                (SDMEM_NUM_7>>7)+(SDMEM_NUM_6>>6)+(SDMEM_NUM_5>>5)+ \
                (SDMEM_NUM_4>>4)+(SDMEM_NUM_3>>3)+(SDMEM_NUM_2>>2)+ \
                (SDMEM_NUM_1>>1)+SDMEM_NUM_0 )
#error "Error! Invalid setting for TFAT_SDMEM_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif /* (TFAT_SDMEM_DRIVE_NUM > 0) */


/* for SD SPI memory card */
#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_0   (1)
#define DRV0_DEV_CH       (0)
#else
#define SPI_SDMEM_NUM_0   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_1   (1<<1)
#define DRV1_DEV_CH       (0 + SPI_SDMEM_NUM_0)
#else
#define SPI_SDMEM_NUM_1   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_2   (1<<2)
#define DRV2_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1))
#else
#define SPI_SDMEM_NUM_2   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_3   (1<<3)
#define DRV3_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2))
#else
#define SPI_SDMEM_NUM_3   (0)
#endif //  (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_4   (1<<4)
#define DRV4_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2) + (SPI_SDMEM_NUM_3>>3))
#else
#define SPI_SDMEM_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_5   (1<<5)
#define DRV5_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2) + (SPI_SDMEM_NUM_3>>3) \
                            + (SPI_SDMEM_NUM_4>>4))
#else
#define SPI_SDMEM_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_6   (1<<6)
#define DRV6_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2) + (SPI_SDMEM_NUM_3>>3) \
                            + (SPI_SDMEM_NUM_4>>4) + (SPI_SDMEM_NUM_5>>5))
#else
#define SPI_SDMEM_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_7   (1<<7)
#define DRV7_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2) + (SPI_SDMEM_NUM_3>>3) \
                            + (SPI_SDMEM_NUM_4>>4) + (SPI_SDMEM_NUM_5>>5) \
                            + (SPI_SDMEM_NUM_6>>6))
#else
#define SPI_SDMEM_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_8   (1<<8)
#define DRV8_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2) + (SPI_SDMEM_NUM_3>>3) \
                            + (SPI_SDMEM_NUM_4>>4) + (SPI_SDMEM_NUM_5>>5) \
                            + (SPI_SDMEM_NUM_6>>6) + (SPI_SDMEM_NUM_7>>7))
#else
#define SPI_SDMEM_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SPI_SDMEM)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SPI_SDMEM)
#define SPI_SDMEM_NUM_9   (1<<9)
#define DRV9_DEV_CH       (0 + SPI_SDMEM_NUM_0 + (SPI_SDMEM_NUM_1>>1) \
                            + (SPI_SDMEM_NUM_2>>2) + (SPI_SDMEM_NUM_3>>3) \
                            + (SPI_SDMEM_NUM_4>>4) + (SPI_SDMEM_NUM_5>>5) \
                            + (SPI_SDMEM_NUM_6>>6) + (SPI_SDMEM_NUM_7>>7) \
                            + (SPI_SDMEM_NUM_8>>8))
#else
#define SPI_SDMEM_NUM_9   (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SPI_SDMEM)

static uint32_t TFAT_DRIVE_SPI_SDMEM_ALLOC = (SPI_SDMEM_NUM_9 | SPI_SDMEM_NUM_8 | \
                                        SPI_SDMEM_NUM_7 | SPI_SDMEM_NUM_6 | \
                                        SPI_SDMEM_NUM_5 | SPI_SDMEM_NUM_4 | \
                                        SPI_SDMEM_NUM_3 | SPI_SDMEM_NUM_2 | \
                                        SPI_SDMEM_NUM_1 | SPI_SDMEM_NUM_0);

