Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
#if TFAT_SPI_SDMEM_DRIVE_NUM != ((SPI_SDMEM_NUM_9>>9)+(SPI_SDMEM_NUM_8>>8) \
                                +(SPI_SDMEM_NUM_7>>7)+(SPI_SDMEM_NUM_6>>6) \
                                +(SPI_SDMEM_NUM_5>>5)+ (SPI_SDMEM_NUM_4>>4) \
                                +(SPI_SDMEM_NUM_3>>3)+(SPI_SDMEM_NUM_2>>2) \
                                +(SPI_SDMEM_NUM_1>>1)+SPI_SDMEM_NUM_0)
#error "Error! Invalid setting for TFAT_SPI_SDMEM_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif /* (TFAT_SPI_SDMEM_DRIVE_NUM > 0) */


/* for MMC */
#if (TFAT_MMC_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_MMC)
#define MMC_NUM_0    (1)
#define DRV0_DEV_CH  (0)
#else
#define MMC_NUM_0    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_MMC)
#define MMC_NUM_1    (1<<1)
#define DRV1_DEV_CH  (0 + MMC_NUM_0)
#else
#define MMC_NUM_1    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_MMC)
#define MMC_NUM_2    (1<<2)
#define DRV2_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1))
#else
#define MMC_NUM_2    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_MMC)
#define MMC_NUM_3    (1<<3)
#define DRV3_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2))
#else
#define MMC_NUM_3    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_MMC)
#define MMC_NUM_4    (1<<4)
#define DRV4_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) \
                        + (MMC_NUM_3>>3))
#else
#define MMC_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_MMC)
#define MMC_NUM_5    (1<<5)
#define DRV5_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) \
                        + (MMC_NUM_3>>3) + (MMC_NUM_4>>4))
#else
#define MMC_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_MMC)
#define MMC_NUM_6    (1<<6)
#define DRV6_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) \
                        + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5))
#else
#define MMC_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_MMC)
#define MMC_NUM_7    (1<<7)
#define DRV7_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) \
                        + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) \
                        + (MMC_NUM_5>>5) + (MMC_NUM_6>>6))
#else
#define MMC_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_MMC)
#define MMC_NUM_8    (1<<8)
#define DRV8_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) \
                        + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5) \
                        + (MMC_NUM_6>>6) + (MMC_NUM_7>>7))
#else
#define MMC_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_MMC)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_MMC)
#define MMC_NUM_9    (1<<9)
#define DRV9_DEV_CH  (0 + MMC_NUM_0 + (MMC_NUM_1>>1) + (MMC_NUM_2>>2) \
                        + (MMC_NUM_3>>3) + (MMC_NUM_4>>4) + (MMC_NUM_5>>5) \
                        + (MMC_NUM_6>>6) + (MMC_NUM_7>>7) + (MMC_NUM_8>>8))
#else
#define MMC_NUM_9    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_MMC)

static uint32_t TFAT_DRIVE_MMC_ALLOC = (MMC_NUM_9 | MMC_NUM_8 | MMC_NUM_7 | \
                                        MMC_NUM_6 | MMC_NUM_5 | MMC_NUM_4 | \
                                        MMC_NUM_3 | MMC_NUM_2 | MMC_NUM_1 | \
                                        MMC_NUM_0);

#if TFAT_MMC_DRIVE_NUM != ((MMC_NUM_9>>9)+(MMC_NUM_8>>8)+(MMC_NUM_7>>7) \
                            +(MMC_NUM_6>>6)+(MMC_NUM_5>>5)+ (MMC_NUM_4>>4) \
                            +(MMC_NUM_3>>3)+(MMC_NUM_2>>2)+(MMC_NUM_1>>1) \
                            +MMC_NUM_0)
#error "Error! Invalid setting for TFAT_MMC_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif /* (TFAT_MMC_DRIVE_NUM > 0) */

/* for USB mini */
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_0    (1)
#define DRV0_DEV_CH       (0)
#else
#define USB_MINI_NUM_0    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_1    (1<<1)
#define DRV1_DEV_CH       (0 + USB_MINI_NUM_0)
#else
#define USB_MINI_NUM_1    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_2    (1<<2)
#define DRV2_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1))
#else
#define USB_MINI_NUM_2    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_3    (1<<3)
#define DRV3_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2))
#else
#define USB_MINI_NUM_3    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_4    (1<<4)
#define DRV4_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2) + (USB_MINI_NUM_3>>3))
#else
#define USB_MINI_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_5    (1<<5)
#define DRV5_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2) + (USB_MINI_NUM_3>>3) \
                            + (USB_MINI_NUM_4>>4))
#else
#define USB_MINI_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_6    (1<<6)
#define DRV6_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2) + (USB_MINI_NUM_3>>3) \
                            + (USB_MINI_NUM_4>>4) + (USB_MINI_NUM_5>>5))
#else
#define USB_MINI_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_7    (1<<7)
#define DRV7_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2) + (USB_MINI_NUM_3>>3) \
                            + (USB_MINI_NUM_4>>4) + (USB_MINI_NUM_5>>5) \
                            + (USB_MINI_NUM_6>>6))
#else
#define USB_MINI_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_8    (1<<8)
#define DRV8_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2) + (USB_MINI_NUM_3>>3) \
                            + (USB_MINI_NUM_4>>4) + (USB_MINI_NUM_5>>5) \
                            + (USB_MINI_NUM_6>>6) + (USB_MINI_NUM_7>>7))
#else
#define USB_MINI_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_USB_MINI)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_USB_MINI)
#define USB_MINI_NUM_9    (1<<9)
#define DRV9_DEV_CH       (0 + USB_MINI_NUM_0 + (USB_MINI_NUM_1>>1) \
                            + (USB_MINI_NUM_2>>2) + (USB_MINI_NUM_3>>3) \
                            + (USB_MINI_NUM_4>>4) + (USB_MINI_NUM_5>>5) \
                            + (USB_MINI_NUM_6>>6) + (USB_MINI_NUM_7>>7) \
                            + (USB_MINI_NUM_8>>8))
#else
#define USB_MINI_NUM_9    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_USB_MINI)

static uint32_t TFAT_DRIVE_USB_MINI_ALLOC = (USB_MINI_NUM_9 | USB_MINI_NUM_8 | \
                                            USB_MINI_NUM_7 | USB_MINI_NUM_6 | \
                                            USB_MINI_NUM_5 | USB_MINI_NUM_4 | \
                                            USB_MINI_NUM_3 | USB_MINI_NUM_2 | \
                                            USB_MINI_NUM_1 | USB_MINI_NUM_0);

#if TFAT_USB_MINI_DRIVE_NUM != ((USB_MINI_NUM_9>>9)+(USB_MINI_NUM_8>>8) \
                                +(USB_MINI_NUM_7>>7)+(USB_MINI_NUM_6>>6) \
                                +(USB_MINI_NUM_5>>5)+(USB_MINI_NUM_4>>4) \
                                +(USB_MINI_NUM_3>>3)+(USB_MINI_NUM_2>>2)\
                                +(USB_MINI_NUM_1>>1)+USB_MINI_NUM_0)
#error "Error! Invalid setting for TFAT_USB_MINI_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif /* (TFAT_USB_MINI_DRIVE_NUM > 0) */

