Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/* for FLASH */
#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
#if (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_0    (1)
#define DRV0_DEV_CH           (0)
#else
#define SERIAL_FLASH_NUM_0    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_0 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_1    (1<<1)
#define DRV1_DEV_CH           (0 + SERIAL_FLASH_NUM_0)
#else
#define SERIAL_FLASH_NUM_1    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_1 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_2    (1<<2)
#define DRV2_DEV_CH           (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1))
#else
#define SERIAL_FLASH_NUM_2    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_2 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_3    (1<<3)
#define DRV3_DEV_CH    (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                        + (SERIAL_FLASH_NUM_2>>2))
#else
#define SERIAL_FLASH_NUM_3    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_3 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_4    (1<<4)
#define DRV4_DEV_CH    (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                            + (SERIAL_FLASH_NUM_2>>2) + (SERIAL_FLASH_NUM_3>>3))
#else
#define SERIAL_FLASH_NUM_4    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_4 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_5    (1<<5)
#define DRV5_DEV_CH    (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                        + (SERIAL_FLASH_NUM_2>>2) + (SERIAL_FLASH_NUM_3>>3) \
                        + (SERIAL_FLASH_NUM_4>>4))
#else
#define SERIAL_FLASH_NUM_5    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_5 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_6    (1<<6)
#define DRV6_DEV_CH    (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                        + (SERIAL_FLASH_NUM_2>>2) + (SERIAL_FLASH_NUM_3>>3) \
                        + (SERIAL_FLASH_NUM_4>>4) + (SERIAL_FLASH_NUM_5>>5))
#else
#define SERIAL_FLASH_NUM_6    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_6 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_7    (1<<7)
#define DRV7_DEV_CH    (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                        + (SERIAL_FLASH_NUM_2>>2) + (SERIAL_FLASH_NUM_3>>3) \
                        + (SERIAL_FLASH_NUM_4>>4) + (SERIAL_FLASH_NUM_5>>5) \
                        + (SERIAL_FLASH_NUM_6>>6))
#else
#define SERIAL_FLASH_NUM_7    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_7 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_8    (1<<8)
#define DRV8_DEV_CH (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                    + (SERIAL_FLASH_NUM_2>>2) + (SERIAL_FLASH_NUM_3>>3) \
                    + (SERIAL_FLASH_NUM_4>>4) + (SERIAL_FLASH_NUM_5>>5) \
                    + (SERIAL_FLASH_NUM_6>>6) + (SERIAL_FLASH_NUM_7>>7))
#else
#define SERIAL_FLASH_NUM_8    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_8 == TFAT_CTRL_SERIAL_FLASH)
#if (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SERIAL_FLASH)
#define SERIAL_FLASH_NUM_9    (1<<9)
#define DRV9_DEV_CH    (0 + SERIAL_FLASH_NUM_0 + (SERIAL_FLASH_NUM_1>>1) \
                        + (SERIAL_FLASH_NUM_2>>2) + (SERIAL_FLASH_NUM_3>>3) \
                        + (SERIAL_FLASH_NUM_4>>4) + (SERIAL_FLASH_NUM_5>>5) \
                        + (SERIAL_FLASH_NUM_6>>6) + (SERIAL_FLASH_NUM_7>>7) \
                        + (SERIAL_FLASH_NUM_8>>8))
#else
#define SERIAL_FLASH_NUM_9    (0)
#endif // (TFAT_DRIVE_ALLOC_NUM_9 == TFAT_CTRL_SERIAL_FLASH)

static uint32_t TFAT_DRIVE_FLASH_ALLOC = (SERIAL_FLASH_NUM_9 | SERIAL_FLASH_NUM_8 | \
                                    SERIAL_FLASH_NUM_7 | SERIAL_FLASH_NUM_6 | \
                                    SERIAL_FLASH_NUM_5 | SERIAL_FLASH_NUM_4 | \
                                    SERIAL_FLASH_NUM_3 | SERIAL_FLASH_NUM_2 | \
                                    SERIAL_FLASH_NUM_1 | SERIAL_FLASH_NUM_0);

#if TFAT_SERIAL_FLASH_DRIVE_NUM != ((SERIAL_FLASH_NUM_9>>9)+(SERIAL_FLASH_NUM_8>>8) \
                            +(SERIAL_FLASH_NUM_7>>7)+(SERIAL_FLASH_NUM_6>>6) \
                            +(SERIAL_FLASH_NUM_5>>5)+ (SERIAL_FLASH_NUM_4>>4) \
                            +(SERIAL_FLASH_NUM_3>>3)+(SERIAL_FLASH_NUM_2>>2) \
                            +(SERIAL_FLASH_NUM_1>>1)+SERIAL_FLASH_NUM_0)
#error "Error! Invalid setting for TFAT_SERIAL_FLASH_DRIVE_NUM or TFAT_DRIVE_ALLOC_NUM_x in r_tfat_driver_rx_config.h"
#endif

#endif /* (TFAT_SERIAL_FLASH_DRIVE_NUM > 0) */

#ifndef DRV0_DEV_CH
#define DRV0_DEV_CH  (0)
#endif
#ifndef DRV1_DEV_CH
#define DRV1_DEV_CH  (0)
#endif
#ifndef DRV2_DEV_CH
#define DRV2_DEV_CH  (0)
#endif
#ifndef DRV3_DEV_CH
#define DRV3_DEV_CH  (0)
#endif
#ifndef DRV4_DEV_CH
#define DRV4_DEV_CH  (0)
#endif
#ifndef DRV5_DEV_CH
#define DRV5_DEV_CH  (0)
#endif
#ifndef DRV6_DEV_CH
#define DRV6_DEV_CH  (0)
#endif
#ifndef DRV7_DEV_CH
#define DRV7_DEV_CH  (0)
#endif
#ifndef DRV8_DEV_CH
#define DRV8_DEV_CH  (0)
#endif
#ifndef DRV9_DEV_CH
#define DRV9_DEV_CH  (0)
#endif

#define TFAT_DRIVE_ALLOC_NUM_MAX    (TFAT_DRIVE_NUM_MAX)

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
*******************************************************************************/
static uint8_t drive_alloc_tbl[TFAT_DRIVE_ALLOC_NUM_MAX][2] =
{
    { TFAT_DRIVE_ALLOC_NUM_0, DRV0_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_1, DRV1_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_2, DRV2_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_3, DRV3_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_4, DRV4_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_5, DRV5_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_6, DRV6_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_7, DRV7_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_8, DRV8_DEV_CH },
    { TFAT_DRIVE_ALLOC_NUM_9, DRV9_DEV_CH },
};

