Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/******************************************************************************
* Function Name : chk_use_usb
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_USB_DRIVE_NUM > 0)
static uint8_t chk_use_usb(uint8_t drive)
{
    return (((TFAT_DRIVE_USB_ALLOC & (0x01 << drive)) != 0) ?  0x01 : 0x00);
}
#endif /* USE_USB */

/******************************************************************************
* Function Name : chk_use_sdmem
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_SDMEM_DRIVE_NUM > 0)
static uint8_t chk_use_sdmem(uint8_t drive)
{
    return (((TFAT_DRIVE_SDMEM_ALLOC & (0x01 << drive)) != 0) ?  0x01 : 0x00);
}
#endif /* USE_SDMEM */

/******************************************************************************
* Function Name : chk_use_spi_sdmem
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
static uint8_t chk_use_spi_sdmem(uint8_t drive)
{
    return (((TFAT_DRIVE_SPI_SDMEM_ALLOC & (0x01 << drive)) != 0) ?  0x01 : 0x00);
}
#endif /* USE_SPI_SDMEM */

/******************************************************************************
* Function Name : chk_use_mmc
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if TFAT_MMC_DRIVE_NUM > 0
static uint8_t chk_use_mmc(uint8_t drive)
{
    return (((TFAT_DRIVE_MMC_ALLOC & (0x01 << drive)) != 0) ?  0x01 : 0x00);
}
#endif /* USE_MMC */

/******************************************************************************
* Function Name : chk_use_usb_mini
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
static uint8_t chk_use_usb_mini(uint8_t drive)
{
    return (((TFAT_DRIVE_USB_MINI_ALLOC & (0x01 << drive)) != 0) ?  0x01 : 0x00);
}
#endif /* USE_USB */

/******************************************************************************
* Function Name : chk_use_flash
* Description   : allocation check
* Arguments     : uint8_t drive : Physical drive number for TFAT module
* Return value  : true : 0x01
******************************************************************************/
#if TFAT_SERIAL_FLASH_DRIVE_NUM > 0
static uint8_t chk_use_flash(uint8_t drive)
{
    return (((TFAT_DRIVE_FLASH_ALLOC & (0x01 << drive)) != 0) ?  0x01 : 0x00);
}
#endif /* USE_FLASH */


/**********************************************************************************************************************
* Function Name: disk_initialize
*******************************************************************************************************************//**
* @brief The disk_initialize() function is called to initialize the storage device.
*
* @param[in]    pdrv  Physical drive number to identify the target device. Always zero at single drive system.
*
* @return This function returns the current drive status flags as the result. For details of the drive status,
* refer to the disk_status() function.
*
* @details This function initializes the storage device and puts it ready to generic read/write. When the function
* succeeds, STA_NOINIT flag in the return value is cleared.\n
* Remarks: This function needs to be under the control of FatFs module. Application program MUST NOT call this function,
* or FAT structure on the volume can be broken. To re-initialize the filesystem, use f_mount function instead.
* @note None
*/
DSTATUS disk_initialize (
    BYTE pdrv    /* Physical drive number to identify the drive */
)
{
    DSTATUS ret = RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if (chk_use_usb(pdrv))
    {
        /* function for USB */
        ret = usb_disk_initialize(drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if (chk_use_sdmem(pdrv))
    {
        /* function for SDMEM */
        ret = sdmem_disk_initialize(drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
    if (chk_use_spi_sdmem(pdrv))
    {
        /* function for SPI SDMEM */
        ret = spi_sdmem_disk_initialize(drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_MMC_DRIVE_NUM > 0)
    if (chk_use_mmc(pdrv))
    {
        /* function for mmc */
        ret = mmcif_disk_initialize(drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if (chk_use_usb_mini(pdrv))
    {
        /* function for USB Mini */
        ret = usb_mini_disk_initialize(drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    if (chk_use_flash(pdrv))
    {
        /* function for FLASH */
        ret = flash_spi_disk_initialize(drive_alloc_tbl[pdrv][1]);
    }
#endif

    return  ret;
}
/******************************************************************************
 End of function disk_initialize
 *****************************************************************************/


/***********************************************************************************************************************
* Function Name: disk_read
********************************************************************************************************************//**
* @brief This function is called to read data from the sector(s) of storage device.
*
* @param[in]    pdrv   Physical drive number to identify the target device.
*
* @param[out]   buff   Pointer to the first item of the byte array to store read data. Size of read data will
* be the sector size * count bytes.
*
* @param[in]    sector Start sector number in 32-bit logical block address (LBA).
*
* @param[in]    count  Number of sectors to read.
*
* @retval RES_OK     The function succeeded.
*
* @retval RES_ERROR  An unrecoverable hard error occurred during the read operation.
*
* @retval RES_PARERR Invalid parameter.
*
* @retval RES_NOTRDY The device has not been initialized.
*
* @details Read/write operation to the generic storage devices, such as memory card, hard disk and optical disk, is
* done in unit of block of data bytes called sector. FatFs supports the sector size in the range of 512 to 4096 bytes.
* When FatFs is configured for fixed sector size (FF_MIN_SS == FF_MAX_SS, this is the most case), the read/write
* function must work at that sector size. When FatFs is configured for variable sector size (FF_MIN_SS < FF_MAX_SS),
* the sector size of medium is inquired with disk_ioctl() function immediately following disk_initialize() function
* succeeded.\n
* There are some considerations about the memory address passed via buff. It is not that always aligned to word
* boundary because the argument is defined as BYTE*. The unaligned transfer request can occur at direct transfer.
* If the bus architecture, especially DMA controller, does not allow unaligned memory access, it should be solved
* in this function. If it is the case, there are some workarounds described below to avoid this issue.\n
* Convert word transfer to byte transfer with some method in this function. - Recommended.\n
* On the f_read() calls, avoid long read request that includes a whole sector. - Any direct transfer never
* occurs.\n
* On the f_read(fp, dat, btw, bw) calls, make sure that (((UINT)dat & 3) == (f_tell(fp) & 3)) is true. - Word
* alignment of buff is guaranteed.\n
* Also, the memory area may be out of reach in DMA. This is the case if it is in tightly coupled memory which is
* usually used for stack. Use double buffered transfer or avoid to define any file I/O buffer includes FatFs and
* FIL structure as local variables where on the stack.\n
* Generally, a multiple sector read request must not be split into single sector transactions to the storage
* device, or read throughput gets worse.
* @note None
*/
DRESULT disk_read (
    BYTE pdrv,        /* Physical drive number to identify the drive */
    BYTE *buff,       /* Data buffer to store read data */
    LBA_t sector,     /* Start sector in LBA */
    UINT count        /* Number of sectors to read */
)
{
    DRESULT ret = RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if (chk_use_usb(pdrv))
    {
        /* function for USB */
        ret = usb_disk_read(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if (chk_use_sdmem(pdrv))
    {
        /* function for SDMEM */
        ret = sdmem_disk_read(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
    if (chk_use_spi_sdmem(pdrv))
    {
        /* function for SPI SDMEM */
        ret = spi_sdmem_disk_read(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_MMC_DRIVE_NUM > 0)
    if (chk_use_mmc(pdrv))
    {
        /* function for MMC */
        ret = mmcif_disk_read(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if (chk_use_usb_mini(pdrv))
    {
        /* function for USB Mini */
        ret = usb_mini_disk_read(drive_alloc_tbl[pdrv][1], buff,
                                    sector, count);
    }
#endif

#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    if ( chk_use_flash(pdrv) )
    {
        /* function for FLASH */
        ret = flash_spi_disk_read(drive_alloc_tbl[pdrv][1], buff,
                                    sector, count);
    }
#endif

    return ret;
}
/******************************************************************************
 End of function disk_read
 *****************************************************************************/


