Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/***********************************************************************************************************************
* Function Name: disk_write
********************************************************************************************************************//**
* @brief This function is called to write data to the sector(s) of storage device.
*
* @param[in]   pdrv   Physical drive number to identify the target device.
*
* @param[in]   buff   Pointer to the first item of the byte array to be written. The size of data to be written
* is sector size * count bytes.
*
* @param[in]   sector Start sector number in 32-bit logical block address (LBA).
*
* @param[in]   count  Number of sectors to write.
*
* @retval RES_OK     The function succeeded.
*
* @retval RES_ERROR  An unrecoverable hard error occurred during the write operation.
*
* @retval RES_WRPRT  The device is write-protected.
*
* @retval RES_PARERR Invalid parameter.
*
* @retval RES_NOTRDY The device has not been initialized.
*
* @details The specified memory address is not that always aligned to word boundary because the argument is
* defined as BYTE*. For more information, refer to the description of disk_read() function.\n
* Generally, a multiple sector write request (count > 1) must not be split into single sector transactions
* to the storage device, or the file write throughput will be drastically decreased.\n
* FatFs expects delayed write function of the disk control layer. The write operation to the media does not
* need to be completed at return from this function by what write operation is in progress or data is only
* stored into the write-back cache. But writting data on the buff is invalid after return from this function.
* The write completion request is done by CTRL_SYNC command of disk_ioctl() function. Therefore, if a delayed
* write function is implemented, the write throughput of the filesystem will be improved.\n
* Remarks: Application program MUST NOT call this function, or FAT structure on the volume can be collapsed.
* @note This function is not needed when FF_FS_READONLY = 1.
*/
DRESULT disk_write (
    BYTE pdrv,            /* Physical drive number to identify the drive */
    const BYTE *buff,     /* Data to be written */
    LBA_t sector,         /* Start sector in LBA */
    UINT count            /* Number of sectors to write */
)
{
    DRESULT ret = RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if (chk_use_usb(pdrv))
    {
        /* function for USB */
        ret = usb_disk_write(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if (chk_use_sdmem(pdrv))
    {
        /* function for SDMEM */
        ret = sdmem_disk_write(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
    if (chk_use_spi_sdmem(pdrv))
    {
        /* function for SPI SDMEM */
        ret = spi_sdmem_disk_write(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_MMC_DRIVE_NUM > 0)
    if (chk_use_mmc(pdrv))
    {
        /* function for MMC */
        ret = mmcif_disk_write(drive_alloc_tbl[pdrv][1], buff, sector, count);
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if (chk_use_usb_mini(pdrv))
    {
        /* function for USB Mini */
        ret = usb_mini_disk_write(drive_alloc_tbl[pdrv][1], buff,
                                    sector, count);
    }
#endif

#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    if (chk_use_flash(pdrv))
    {
        /* function for FLASH */
        ret = flash_spi_disk_write(drive_alloc_tbl[pdrv][1], buff,
                                    sector, count);
    }
#endif

    return ret;
}
/******************************************************************************
 End of function disk_write
 *****************************************************************************/


/***********************************************************************************************************************
* Function Name: disk_ioctl
********************************************************************************************************************//**
* @brief This function is called to control device specific features and miscellaneous functions other
* than generic read/write.
*
* @param[in]      pdrv  Physical drive number to identify the target device.
*
* @param[in]      cmd   Command code.
*
* @param[in, out] buff  Pointer to the parameter depends on the command code. Do not care if the command has no
* parameter to be passed.
*
* @retval RES_OK     The function succeeded.
*
* @retval RES_ERROR  An error occurred.
*
* @retval RES_PARERR The command code or parameter is invalid.
*
* @retval RES_NOTRDY The device has not been initialized.
*
* @details The FatFs module requires only five device general-purpose commands. See Section disk_ioctl() in the
* application note for details.
* @note The disk_ioctl() function is not needed when FF_FS_READONLY = 1 and FF_MAX_SS = FF_MIN_SS.
*/
DRESULT disk_ioctl (
    BYTE pdrv,        /* Physical drive nmuber (0..) */
    BYTE cmd,         /* Control code */
    void *buff        /* Buffer to send/receive control data */
)
{
    DRESULT ret = RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if (chk_use_usb(pdrv))
    {
        /* function for USB */
        ret = usb_disk_ioctl(drive_alloc_tbl[pdrv][1], cmd, buff);
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if (chk_use_sdmem(pdrv))
    {
        /* function for SDMEM */
        ret = sdmem_disk_ioctl (drive_alloc_tbl[pdrv][1], cmd, buff);
    }
#endif

#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
    if (chk_use_spi_sdmem(pdrv))
    {
        /* function for SPI SDMEM */
        ret = spi_sdmem_disk_ioctl (drive_alloc_tbl[pdrv][1], cmd, buff);
    }
#endif

#if (TFAT_MMC_DRIVE_NUM > 0)
    if (chk_use_mmc(pdrv))
    {
        /* function for MMC */
        ret = mmcif_disk_ioctl (drive_alloc_tbl[pdrv][1], cmd, buff);
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if (chk_use_usb_mini(pdrv))
    {
        /* function for USB Mini */
        ret = usb_mini_disk_ioctl(drive_alloc_tbl[pdrv][1], cmd, buff);
    }
#endif

#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    if (chk_use_flash(pdrv))
    {
        /* function for FLASH */
        ret = flash_spi_disk_ioctl (drive_alloc_tbl[pdrv][1], cmd, buff);
    }
#endif

    return ret;
}
/******************************************************************************
 End of function disk_ioctl
 *****************************************************************************/


