Kageyana/RX671_MCR/RX671_MCR/src/smc_gen/r_tfat_driver_rx/src/r_tfat_drv_if.c
/***********************************************************************************************************************
* Function Name: disk_status
********************************************************************************************************************//**
* @brief This function is called to inquire the current drive status.
*
* @param[in] pdrv Physical drive number to identify the target device. Always zero at single drive system.
*
* @return The current drive status is returned in combination of status flags described below. FatFs refers only
* to STA_NOINIT and STA_PROTECT.
* \li STA_NOINIT: Indicates that the device has not been initialized and not ready to work. This flag is set
* on system reset, media removal or failure of disk_initialize() function. It is cleared on disk_initialize function
* succeeded. Any media change that occurs asynchronously must be captured and reflected to the status flags, or
* auto-mount function will not work correctly. If the system does not support media change detection, the
* application program needs to explicitly re-mount the volume with f_mount function after each media change.
* \li STA_NODISK: Indicates that there is no medium in the drive. This is always cleared at fixed disk drive. Note that
* FatFs does not refer to this flag.
* \li STA_PROTECT: Indicates that the medium is write-protected. This is always cleared at the drives without
* the write protect function. Not valid if STA_NODISK is set.
*
* @details None
* @note None
*/
DSTATUS disk_status (
    BYTE pdrv        /* Physical drive number to identify the drive */
)
{
    DSTATUS ret = RES_PARERR;

#if (TFAT_USB_DRIVE_NUM > 0)
    if (chk_use_usb(pdrv))
    {
        /* function for USB */
        ret = usb_disk_status (drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if (chk_use_sdmem(pdrv))
    {
        /* function for SDMEM */
        ret = sdmem_disk_status (drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
    if (chk_use_spi_sdmem(pdrv))
    {
        /* function for SPI SDMEM */
        ret = spi_sdmem_disk_status (drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_MMC_DRIVE_NUM > 0)
    if (chk_use_mmc(pdrv))
    {
        /* function for MMC */
        ret = mmcif_disk_status (drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if (chk_use_usb_mini(pdrv))
    {
        /* function for USB Mini */
        ret = usb_mini_disk_status (drive_alloc_tbl[pdrv][1]);
    }
#endif

#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    if (chk_use_flash(pdrv))
    {
        /* function for FLASH */
        ret = flash_spi_disk_status (drive_alloc_tbl[pdrv][1]);
    }
#endif

    return ret;
}
/******************************************************************************
 End of function disk_status
 *****************************************************************************/


/******************************************************************************
* Function Name : disk_1ms_interval
* Description   : This function is used to intialize the 1ms timer
* Arguments     : None
* Return value  : None
******************************************************************************/
void disk_1ms_interval(void)
{
#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    flash_spi_1ms_interval (); /* function for FLASH */
#endif
}
/******************************************************************************
 End of function disk_1ms_interval
 *****************************************************************************/


#if !FF_FS_READONLY && !FF_FS_NORTC
/***********************************************************************************************************************
* Function Name: get_fattime
********************************************************************************************************************//**
* @brief This function is called to get the current time.
*
* @return Current local time shall be returned as bit-fields packed into a DWORD value. The bit fields are
* as follows:
* \li bit31:25 Year origin from the 1980 (0..127, e.g. 37 for 2017)
* \li bit24:21 Month (1..12)
* \li bit20:16 Day of the month (1..31)
* \li bit15:11 Hour (0..23)
* \li bit10:5  Minute (0..59)
* \li bit4:0   Second / 2 (0..29, e.g. 25 for 50)
*
* @details The get_fattime() function shall return any valid time even if the system does not support a real time
* clock. If a zero is returned, the file will not have a valid timestamp.
* @note This function is not needed when FF_FS_READONLY = 1 or FF_FS_NORTC = 1.
*/
DWORD get_fattime(void)
{
    uint32_t tmr;
    SYS_TIME time;

    /* Disable interrupts */
    R_BSP_InterruptsDisable();

    R_SYS_TIME_GetCurrentTime(&time);

    /* Convert the time to store in FAT entry */
    tmr  =  (((uint32_t)time.year - 60) << 25);

    /* Cast to 'uint32_t' type */
    tmr |=  ((uint32_t)time.month << 21);

    /* Cast to 'uint32_t' type */
    tmr |=  ((uint32_t)time.day << 16);

    /* Cast to 'uint32_t' type */
    tmr |=  ((uint32_t)time.hour << 11);

    /* Cast to 'uint32_t' type */
    tmr |=  ((uint32_t)time.min << 5);

    /* Cast to 'uint32_t' type */
    tmr |=  ((uint32_t)time.sec >> 1);

    /* Enable interrupts    */
    R_BSP_InterruptsEnable();

    return (DWORD)tmr;
}
/******************************************************************************
 End of function get_fattime
 *****************************************************************************/

#endif /* #if !FF_FS_READONLY && !FF_FS_NORTC */

/***********************************************************************************************************************
* Function Name: drv_change_alloc
********************************************************************************************************************//**
* @brief This function changes a drive's allocation. This function has nothing to do with FatFs
* and is a unique API of Renesas.
*
* @param[in] tfat_drv    The physical drive number for TFAT FIT.
*
* @param[in] dev_type    The device defines type (TFAT_USB_DRIVE_NUM, TFAT_SDMEM_DRIVE_NUM, or TFAT_USB_MINI_DRIVE_NUM).
*
* @param[in] dev_drv_num The drive number/device channel for device driver.
*
* @retval RES_OK     The function succeeded.
*
* @retval RES_PARERR The specified value of tfat_drv is invalid.
*
* @details The drive used for TFAT FIT is specified by the TFAT_DRIVE_ALLOC_NUM_i definition in
* r_tfat_driver_rx_config.h, and the drive number for TFAT FIT is associated with the drive number of
* the memory driver.\n
* Drive numbers for memory drivers are automatically assigned in ascending order.\n
* Use this function if you want to change the association dynamically.
* @note None
*/
DRESULT drv_change_alloc(TFAT_DRV_NUM tfat_drv, uint8_t dev_type,
                                            uint8_t dev_drv_num)
{
    if (TFAT_DRIVE_ALLOC_NUM_MAX <= tfat_drv)
    {
        return RES_ERROR;
    }

#if (TFAT_USB_DRIVE_NUM > 0)
    if (TFAT_CTRL_USB == dev_type)
    {
        TFAT_DRIVE_USB_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_USB_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_SDMEM_DRIVE_NUM > 0)
    if (TFAT_CTRL_SDMEM == dev_type)
    {
        TFAT_DRIVE_SDMEM_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_SDMEM_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_SPI_SDMEM_DRIVE_NUM > 0)
    if (TFAT_CTRL_SPI_SDMEM == dev_type)
    {
        TFAT_DRIVE_SPI_SDMEM_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_SPI_SDMEM_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_MMC_DRIVE_NUM > 0)
    if (TFAT_CTRL_MMC == dev_type)
    {
        TFAT_DRIVE_MMC_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_MMC_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_USB_MINI_DRIVE_NUM > 0)
    if (TFAT_CTRL_USB_MINI == dev_type)
    {
        TFAT_DRIVE_USB_MINI_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_USB_MINI_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif
#if (TFAT_SERIAL_FLASH_DRIVE_NUM > 0)
    if (TFAT_CTRL_SERIAL_FLASH == dev_type)
    {
        TFAT_DRIVE_FLASH_ALLOC |= (0x01 << tfat_drv);
    }
    else
    {
        TFAT_DRIVE_FLASH_ALLOC &= ~(0x01 << tfat_drv);
    }
#endif

    drive_alloc_tbl[tfat_drv][0] = dev_type;
    drive_alloc_tbl[tfat_drv][1] = dev_drv_num;

    return RES_OK;
}
/******************************************************************************
 End of function drv_change_alloc
 *****************************************************************************/


/*******************************************************************************
End  of file
*******************************************************************************/
